# Read the file with online food delivery data
by Smahi

## Scope
- Read the csv file in pandas dataframe.
- Print head of the dataframe.

## Dataset info
So the dataset contains information like:

* the age of the customer
* marital status of the customer
* occupation of the customer
* monthly income of the customer
- educational qualification of the customer
- family size of the customer
- latitude and longitude of the location of the customer
- pin code of the residence of the customer
- did the customer order again (Output)
- Feedback of the last order (Positive or Negative)

## Summary
- Successfully read the onlinefood.csv file in a pandas dataframe.
- The dataset has 388 rows and 13 columns.

## Imports

In [1]:
# Import libraries
import pandas as pd

In [2]:
# Read csv
df = pd.read_csv("C:/Users/SMAHI/Desktop/Online-food-delivery/Data/onlinefood.csv")

In [3]:
# Preview
df.head()

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Pin code,Output,Feedback,Unnamed: 12
0,20,Female,Single,Student,No Income,Post Graduate,4,12.9766,77.5993,560001,Yes,Positive,Yes
1,24,Female,Single,Student,Below Rs.10000,Graduate,3,12.9770,77.5773,560009,Yes,Positive,Yes
2,22,Male,Single,Student,Below Rs.10000,Post Graduate,3,12.9551,77.6593,560017,Yes,Negative,Yes
3,22,Female,Single,Student,No Income,Graduate,6,12.9473,77.5616,560019,Yes,Positive,Yes
4,22,Male,Single,Student,Below Rs.10000,Post Graduate,4,12.9850,77.5533,560010,Yes,Positive,Yes

In [4]:
# Shape
df.shape

(388, 13)